Revit 2026 API

# ExternalResourceType Class

---

A type class used to distinguish between different kinds of external resource.

SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DBExternalResourceType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceType : GuidEnum
```
```vb
Public Class ExternalResourceType
	Inherits GuidEnum
```
```cpp
public ref class ExternalResourceType : public GuidEnum
```
```fsharp
type ExternalResourceType =
    class
        inherit GuidEnum
    end
```

The ExternalResourceType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalResourceType | Creates a new ExternalResourceType instance. |

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from GuidEnum) |
|  | GetHashCode | Generates a hash code for this Guid-based enum object. (Inherited from GuidEnum) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(ExternalResourceType, ExternalResourceType) | Compares two ExternalResourceType instances. |
|  | Inequality(ExternalResourceType, ExternalResourceType) | Compares two ExternalResourceType instances. |

Revit elements can consume multiple types of external resource data, provided by one or more external servers. Conversely, external servers can support one, or more than one, type of external resource.

#### Reference

Autodesk.Revit.DB Namespace